{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[{"file_id":"https://gist.github.com/MartyushevVA/85b1fbe95c30369b28f7d655b783442a#file--ipynb","timestamp":1664654243267}],"collapsed_sections":[],"name":"Мартюшев Владислав Алексеевич.ipynb"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["# Вариант 2"],"metadata":{"id":"qpl5XkfSlYyn"}},{"cell_type":"markdown","source":["***Кто делает***:\n","\n","1. Зайцев Егор Андреевич\n","2. Зверев Александр Александрович \n","3. Зимина Александра Георгиевна\n","4. Иванов Александр Андреевич \n","5. Калентьев (Топилин) Константин Юрьевич\n","6. Мартюшев Владислав Алексеевич"],"metadata":{"id":"L5MIq7J3lcz3"}},{"cell_type":"markdown","source":["**Задача 1.**\n","\n","Напишите программу, которая принимает два списка и выводит все элементы первого, которых нет во втором."],"metadata":{"id":"suxuOHmSli09"}},{"cell_type":"code","source":["a = [3]\n","b = [3]\n","for i in range (3):\n","  print(f'Введите {i}-ое значение списка №1')\n","  a.append(input())\n","for i in range (3):\n","  print(f'Введите {i}-ое значение списка №2')\n","  b.append(input())\n","fsp = set(a)\n","ssp = set(b)\n","print(fsp - ssp)"],"metadata":{"id":"Fx0y6uvQlqZO"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["**Задача 2.**\n","\n","Вам дан список, переставьте соседние элементы местами."],"metadata":{"id":"QSWi4FNvlpPK"}},{"cell_type":"code","source":["lst= ['a', 4, 'hello', (1,5), 10, 'b']\n","for i in range(0, len(lst)-1, 2):\n","    lst[i], lst[i+1] = lst[i+1], lst[i]\n","print(lst)"],"metadata":{"id":"vrr5JJkVoEcr"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["**Задача 3.**\n","\n","С клавиатуры вводится слово. Напишите проверку на то, является ли строка палиндромом. Палиндром — это слово или фраза, которые одинаково читаются слева направо и справа налево."],"metadata":{"id":"7VpdDp3EoIju"}},{"cell_type":"code","source":["a = input().lower()\n","if a == a[::-1]:\n","    print(\"Палиндром\")\n","else:\n","    print('Не палиндром')"],"metadata":{"id":"TLBqPcawoK1R"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["**Задача 4.**\n","\n","На входе программа получает список целых чисел n. Ваша задача - вывести следующие списки по одному в строке, используя генераторы списков:\n","\n","*   Список, состоящий из квадрытных корней элементов списка n.\n","*   Список, состоящий из целый части от деления на 4 элементов n.\n","*   Список, состоящий только из нечётных элементов n.\n","*   Список, состоящий из чисел, которые если больше 0, то умножаются на 2, если меньше 0, то делятся на 2.\n","*   Список, состоящий из выражений [n[i], n[i]_next], где n[i] - элемент списка n, n[i]_next - следующее значение этого элемента (например, [1,2], [4,5], [0,1].\n","*   Список, состоящий из элементов s, стоящих на позициях, кратных 5."],"metadata":{"id":"jz5JsJ_El6NO"}},{"cell_type":"code","source":["example = [-8, -7, -6, -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5, 6, 7, 8]\n","sq = [i ** (1/2) for i in example]\n","print(*sq, '- корни')\n","div = [i // 4 for i in example]\n","print(*div, '- целые части от деления на 4')\n","onlynec = [i for i in example if i % 2 == 1]\n","print(*onlynec, '- нечетные')\n","usl = [i*2 if i>0 else i/2 for i in example]\n","print(*usl, '- умножение/деление на 2')\n","strusl = [[i, i+1] for i in example]\n","print(*strusl, '- n[i]_next')\n","kr5 = [i for i in example if i%5==0]\n","print(*kr5, '- кратны 5')"],"metadata":{"id":"7PP4mpcgoG2u"},"execution_count":null,"outputs":[]}]}